{"course":{"lectures":[{"description":"Dive into the world of Node.js, a powerful JavaScript runtime environment used for building fast, scalable web applications. Learn the fundamentals of Node.js, including its core concepts, installation process, and how to create your first 'Hello World' application.","title":"What is NodeJS?","embed":"https://www.youtube.com/embed/ohIAiuHMKMI","duration":465},{"description":"Get your Node.js development environment up and running. Explore the installation process, essential tools, and configure your system to build Node.js applications effectively.","title":"Node JS Installation","embed":"https://www.youtube.com/embed/N6PjgN9licA","duration":362},{"description":"Write your first Node.js program! Understand the basics of writing code in Node.js and learn how to execute your scripts. This foundation will set you on the path to building more complex applications.","title":"Hello World NodeJS","embed":"https://www.youtube.com/embed/XhCs5cTYW_8","duration":585},{"description":"Explore the concept of modules in Node.js. Discover how to organize your code into reusable units, understand the different types of modules available, and learn how to import and export functionality between modules.","title":"Modules in NodeJS","embed":"https://www.youtube.com/embed/FSRo41TaHFU","duration":925},{"description":"Master file manipulation in Node.js. Learn how to read, write, and manage files within your Node.js applications. This is crucial for handling data and creating dynamic content.","title":"File Handling in NodeJS","embed":"https://www.youtube.com/embed/YazJFb_i4A0","duration":1097},{"description":"Unravel the inner workings of Node.js. Discover its event-driven architecture, the role of the event loop, and how Node.js efficiently handles multiple requests simultaneously.","title":"How NodeJS Works?","embed":"https://www.youtube.com/embed/y0aTs56DJWk","duration":863},{"description":"Build your own web server from scratch using Node.js. Explore the core HTTP modules and learn how to create routes, handle incoming requests, and respond with appropriate data.","title":"Building HTTP Server in NodeJS","embed":"https://www.youtube.com/embed/ZQsrcayZcSk","duration":1076},{"description":"Learn how to effectively handle URLs within your Node.js applications. Discover how to parse URLs, extract data from them, and use this information to route requests accordingly.","title":"Handling URL's in NodeJS","embed":"https://www.youtube.com/embed/Nt-AsZh5woE","duration":1237},{"description":"Master the art of using different HTTP methods (GET, POST, PUT, DELETE) in your Node.js applications. Learn how each method is used to interact with data and resources on your server.","title":"HTTP METHODS","embed":"https://www.youtube.com/embed/kREAjKyPbSI","duration":818},{"description":"Embrace the power of Express.js, a popular Node.js framework, to simplify web application development.  Discover its features, learn how to set up an Express application, and start building dynamic web applications quickly.","title":"Getting Started with Express and NodeJS","embed":"https://www.youtube.com/embed/N2-FyBBxOZA","duration":688},{"description":"Understand the concepts of versioning in Node.js. Learn how to manage package versions, use versioning tools like npm, and ensure your applications remain compatible with evolving dependencies.","title":"How Versioning Works in NodeJS?","embed":"https://www.youtube.com/embed/ORmB_ABimjM","duration":1270},{"description":"Discover the world of RESTful APIs, a standard architectural style for web services. Learn about the principles of REST, understand how to design and build APIs that adhere to RESTful principles.","title":"What is REST API?","embed":"https://www.youtube.com/embed/cJAyEOZQUQY","duration":941},{"description":"Build robust RESTful APIs using the power of Node.js and Express.js. Learn how to create endpoints, handle different HTTP methods, and design API responses that follow best practices.","title":"Building REST API's using Node and Express.js","embed":"https://www.youtube.com/embed/uNCrMvkPUAE","duration":1227},{"description":"Introducing Postman, a powerful tool for testing and interacting with APIs. Learn how to use Postman to send requests, inspect responses, and manage your API workflow.","title":"Introduction to POSTMAN for REST API's","embed":"https://www.youtube.com/embed/7OzNVIxPLH0","duration":889},{"description":"Explore Express middleware, a fundamental concept in Express.js. Learn how to create custom middleware functions to handle tasks like authentication, validation, and logging across your API endpoints.","title":"Express Middleware","embed":"https://www.youtube.com/embed/n2c0mf1sza4","duration":1190},{"description":"Understand the importance of HTTP headers in API communication. Learn how to work with headers, set custom headers, and use them to convey information between your client and server.","title":"What are HTTP Headers in API","embed":"https://www.youtube.com/embed/mhg3Vwsb88M","duration":1058},{"description":"Master the art of using HTTP status codes. Learn the meaning of different status codes (e.g., 200 OK, 404 Not Found), and how to choose the appropriate code for your API responses.","title":"HTTP Status Codes","embed":"https://www.youtube.com/embed/fLGw2GK884s","duration":936},{"description":"Embark on a journey into the world of MongoDB, a powerful NoSQL database. Learn about its core concepts, data modeling techniques, and how to effectively interact with a MongoDB database.","title":"Getting Started with MongoDB","embed":"https://www.youtube.com/embed/oH0VoYiA8_s","duration":481},{"description":"Connect your Node.js applications to MongoDB using the Mongoose library. Explore the benefits of Mongoose, learn how to define data models, and build robust database interactions.","title":"Connecting NodeJS with MongoDB | Mongoose + Express","embed":"https://www.youtube.com/embed/xrglM8U0Zv8","duration":1158},{"description":"Master the Model-View-Controller (MVC) architectural pattern in Node.js. Learn how to structure your application into logical components (models, views, controllers) for better organization and maintainability.","title":"Model View Controller in NodeJS | MVC Pattern","embed":"https://www.youtube.com/embed/JLtXoru-ipo","duration":1381},{"description":"Create a real-world application - a custom URL shortener - using Node.js and MongoDB. Learn how to design, develop, and deploy a complete application with authentication and database integration.","title":"Create a Custom URL Shortener using Node.JS and MongoDB","embed":"https://www.youtube.com/embed/4WvX9dBjiJo","duration":1390},{"description":"Explore Server-Side Rendering (SSR) using EJS and Node.js. Learn how to generate HTML content on the server side, improving SEO, performance, and user experience for your web applications.","title":"Server Side Rendering with EJS and Node.JS","embed":"https://www.youtube.com/embed/yy9cbu_e3Xg","duration":1524},{"description":"Secure your Node.js applications with robust authentication from scratch. Discover the principles of secure authentication, implement user registration and login, and protect sensitive data.","title":"Building Node.js Authentication from Scratch","embed":"https://www.youtube.com/embed/OWeruyqhiTo","duration":2349},{"description":"Use JWT (JSON Web Tokens) to implement a secure and efficient authentication system in your Node.js applications. Learn how to generate, verify, and manage JWTs for secure user access.","title":"JWT Authentication in NodeJS","embed":"https://www.youtube.com/embed/mGrVmEex6_g","duration":870},{"description":"Understand the role of cookies in Node.js applications. Learn how cookies work, how to set and read cookies, and use them to manage user sessions and preferences.","title":"What are Cookies in NodeJS?","embed":"https://www.youtube.com/embed/kMErso06vHo","duration":1835},{"description":"Explore the concept of authorization in Node.js. Learn how to control access to different parts of your application based on user roles and permissions.","title":"Authorization in NodeJS","embed":"https://www.youtube.com/embed/1uxWtBFOrkk","duration":1173},{"description":"Build your own Discord bot using Node.js. Learn how to interact with the Discord API, create commands, respond to messages, and build exciting functionalities for your Discord server.","title":"Creating Discord Bot in NodeJS","embed":"https://www.youtube.com/embed/5UOMuTWrh6Q","duration":1305},{"description":"Master file uploads in your Node.js applications using the Multer middleware. Learn how to handle file uploads securely, validate file types, and store uploaded files in your desired location.","title":"Uploading Files with NodeJS and Multer","embed":"https://www.youtube.com/embed/WqJ0P8JnftI","duration":851},{"description":"Set the foundation for a full-fledged blogging application. Create the project structure, configure database connections, and define the basic schema for your blog posts.","title":"Setting Up Project - NodeJS Blogging Application with MongoDB","embed":"https://www.youtube.com/embed/6z6CR29gtds","duration":2376},{"description":"Implement a secure authentication system for your blog application. Allow users to register, login, and manage their accounts securely using a robust authentication strategy.","title":"Setting up Authentication  - NodeJS Blogging Application with MongoDB","embed":"https://www.youtube.com/embed/X1AGH8Byj9Y","duration":2301},{"description":"Complete your blog application by adding features such as post creation, editing, commenting, and user profiles. Use Node.js, MongoDB, and EJS to create a fully functional and interactive blog platform.","title":"Complete Blog App - NodeJS, MongoDB and EJS","embed":"https://www.youtube.com/embed/vnWVrjsEeAM","duration":1589},{"description":"Deploy your Node.js application to AWS, a leading cloud platform. Learn how to set up an AWS instance, configure your application for deployment, and ensure your application is accessible globally.","title":"Deploy NodeJS Application on AWS - Amazon Web Services | NodeJS","embed":"https://www.youtube.com/embed/_U0pTlpyMGg","duration":1191},{"description":"Explore the world of real-time communication using WebSockets in Node.js with Socket.IO. Learn how to create real-time chat applications, handle events, and build dynamic interactions between client and server.","title":"WebSocket in NodeJS | Socket.IO - Real Time Messaging","embed":"https://www.youtube.com/embed/UUddpbgPEJM","duration":1947},{"description":"Master the concept of streams in Node.js. Learn how to process data efficiently, handle large files, and improve performance by managing data in a continuous flow.","title":"NodeJS Streams","embed":"https://www.youtube.com/embed/64LJJhT6Ybo","duration":926},{"description":"Discover how to scale your Node.js applications using the cluster module. Learn about the benefits of multi-core processing, how to create worker processes, and effectively manage resources for improved performance.","title":"How to scale NodeJs applications using the cluster module.","embed":"https://www.youtube.com/embed/JoPZ9gEvpz8","duration":758},{"description":"Dive into the world of Nginx, a popular web server and reverse proxy. Understand its architecture, features, and how it can enhance your Node.js application deployments.","title":"What is Nginx?","embed":"https://www.youtube.com/embed/b_B1BEShfBc","duration":705},{"description":"Install and configure Nginx on your system. Learn how to manage Nginx configurations, set up virtual hosts, and optimize Nginx for your specific needs.","title":"Install and Setup Nginx","embed":"https://www.youtube.com/embed/Qmld1te08Ns","duration":796},{"description":"Learn how to serve static content (e.g., images, CSS, JavaScript) efficiently using Nginx. Configure Nginx to handle static files and ensure they are delivered quickly to users.","title":"Serve Static Content with Nginx","embed":"https://www.youtube.com/embed/YkuhqIDUi2A","duration":901},{"description":"Deploy a full Node.js application using Nginx as a reverse proxy. Set up Nginx to forward requests to your Node.js server, improve security, and optimize application performance.","title":"Full Node.js Deployment - NGINX, SSL With Lets Encrypt","embed":"https://www.youtube.com/embed/ofBFl4M4BFk","duration":1885},{"description":"Explore the serverless framework, a powerful tool for deploying and managing serverless applications. Learn how to create serverless functions using Node.js, deploy them to cloud providers, and automate your deployment workflow.","title":"Serverless Framework with NodeJS","embed":"https://www.youtube.com/embed/VvYADzRwJK8","duration":1246},{"description":"Understand the concept of serverless computing, a paradigm shift in application architecture. Explore the advantages and disadvantages of serverless, compare it to traditional monolithic applications, and understand the role of AWS Lambda.","title":"What is Serverless? | Serverless Vs Monolith | AWS Lambda","embed":"https://www.youtube.com/embed/AgOmeANl3ls","duration":2171},{"description":"Dive into the world of GraphQL, a powerful query language for APIs. Learn about the core concepts of GraphQL, understand its advantages over REST, and explore its flexibility in fetching data from APIs.","title":"GraphQL Crash Course - GraphQL NodeJS","embed":"https://www.youtube.com/embed/WtkKwO1viI8","duration":2551},{"description":"Build the backend architecture for a Threads app clone using GraphQL. Design the schema, define mutations and queries, and implement functionalities for creating posts, comments, and user interactions.","title":"Threads App GraphQL Clone | Backend Architecture","embed":"https://www.youtube.com/embed/FbDrEEhG5cM","duration":1134},{"description":"Set up your GraphQL server using Node.js. Learn how to create a GraphQL schema, define resolvers, and connect your server to a database to handle data queries and mutations.","title":"Setting up Graphql Server | Complete GraphQL Series","embed":"https://www.youtube.com/embed/g6YpoVYTd1s","duration":1501},{"description":"Learn how to integrate Prisma, a powerful ORM for GraphQL, with Postgresql. Create data models, define CRUD operations, and leverage Prisma's features for efficient database interactions.","title":"Graphql Prisma Postgresql Setup | Complete GraphQL Series","embed":"https://www.youtube.com/embed/4jiTZGn34_c","duration":1047},{"description":"Refactor your GraphQL code to improve its readability, maintainability, and performance. Learn how to organize your code into modules, implement best practices, and optimize your GraphQL server.","title":"Refactoring GraphQL Code | Complete GraphQL Series","embed":"https://www.youtube.com/embed/MSJImC6cTkY","duration":755},{"description":"Secure your GraphQL server by implementing authentication and authorization. Learn how to integrate JWT authentication, define authorization rules, and protect your GraphQL endpoints.","title":"Authentication with GraphQL Server | Complete GraphQL Series","embed":"https://www.youtube.com/embed/0XFoeaYnc20","duration":1300},{"description":"Implement JWT authentication in your GraphQL server and utilize context to manage user information securely across your application. Learn how to authenticate users, pass user data through the context, and enforce authorization based on user roles.","title":"JWT Authentication and Context in GraphQL","embed":"https://www.youtube.com/embed/8atiBUsAOcI","duration":817}],"name":"Mastering Node.js: From Beginner to Expert","overview":"Learn the fundamentals of Node.js, a powerful JavaScript runtime environment, and build real-world applications from scratch. This comprehensive course covers everything from basic concepts to advanced techniques, including building REST APIs, securing your applications, and deploying to the cloud.","category":"programming","level":"beginner"},"author":"Piyush Garg","channel":"https://www.youtube.com/channel/UCf9T51_FmMlfhiGpoes0yFA","duration":57841}