{
  "course": {
    "lectures": [
      {
        "notes": "This lecture introduces Node.js, a JavaScript runtime environment, exploring its core concepts, features, and how it enables server-side JavaScript development.",
        "title": "What is Node.js?",
        "embed": "https://www.youtube.com/embed/ohIAiuHMKMI",
        "duration": 465
      },
      {
        "notes": "Learn how to install Node.js on your system, including step-by-step instructions for different operating systems and setting up your development environment.",
        "title": "Node.js Installation",
        "embed": "https://www.youtube.com/embed/N6PjgN9licA",
        "duration": 362
      },
      {
        "notes": "Get started with Node.js by writing your first simple program, a classic \"Hello World\" example, to understand the basics of creating and running Node.js applications.",
        "title": "Hello World Node.js",
        "embed": "https://www.youtube.com/embed/XhCs5cTYW_8",
        "duration": 585
      },
      {
        "notes": "Explore the concept of modules in Node.js, understanding how they break down code into reusable components, manage dependencies, and enhance code organization.",
        "title": "Modules in Node.js",
        "embed": "https://www.youtube.com/embed/FSRo41TaHFU",
        "duration": 925
      },
      {
        "notes": "Discover how to work with files in Node.js, covering essential file system operations like reading, writing, creating, and deleting files, along with error handling.",
        "title": "File Handling in Node.js",
        "embed": "https://www.youtube.com/embed/YazJFb_i4A0",
        "duration": 1097
      },
      {
        "notes": "Gain insights into how Node.js works behind the scenes, exploring its event loop mechanism, asynchronous programming, and the non-blocking I/O model that makes it efficient.",
        "title": "How Node.js Works?",
        "embed": "https://www.youtube.com/embed/y0aTs56DJWk",
        "duration": 863
      },
      {
        "notes": "Learn how to build basic HTTP servers in Node.js, understanding the fundamental concepts of HTTP requests and responses, and creating web servers that can handle client connections.",
        "title": "Building HTTP Server in Node.js",
        "embed": "https://www.youtube.com/embed/ZQsrcayZcSk",
        "duration": 1076
      },
      {
        "notes": "Explore different techniques for handling URLs in Node.js, including parsing URL components, routing requests based on paths, and creating dynamic web applications.",
        "title": "Handling URL's in Node.js",
        "embed": "https://www.youtube.com/embed/Nt-AsZh5woE",
        "duration": 1237
      },
      {
        "notes": "Understand the different HTTP methods (GET, POST, PUT, DELETE, etc.), how they are used in web development, and how to implement them in your Node.js applications.",
        "title": "HTTP METHODS",
        "embed": "https://www.youtube.com/embed/kREAjKyPbSI",
        "duration": 818
      },
      {
        "notes": "Get started with Express.js, a popular framework for Node.js, learning about its core features, routing, middleware, and how it simplifies building web applications.",
        "title": "Getting Started with Express and Node.js",
        "embed": "https://www.youtube.com/embed/N2-FyBBxOZA",
        "duration": 688
      },
      {
        "notes": "Explore how versioning works in Node.js, understanding semantic versioning conventions, managing dependencies across projects, and handling compatibility issues.",
        "title": "How Versioning Works in Node.js?",
        "embed": "https://www.youtube.com/embed/ORmB_ABimjM",
        "duration": 1270
      },
      {
        "notes": "Learn about REST APIs, their architectural principles, and how they facilitate communication between different systems through a standardized interface.",
        "title": "What is REST API?",
        "embed": "https://www.youtube.com/embed/cJAyEOZQUQY",
        "duration": 941
      },
      {
        "notes": "Build RESTful APIs using Node.js and Express.js, covering routing, request handling, data manipulation, and creating robust web services.",
        "title": "Building REST API's using Node and Express.js",
        "embed": "https://www.youtube.com/embed/uNCrMvkPUAE",
        "duration": 1227
      },
      {
        "notes": "Get introduced to Postman, a powerful tool for testing and interacting with REST APIs, exploring its features for sending requests, inspecting responses, and managing API documentation.",
        "title": "Introduction to POSTMAN for REST API's",
        "embed": "https://www.youtube.com/embed/7OzNVIxPLH0",
        "duration": 889
      },
      {
        "notes": "Understand the concept of middleware in Express.js, how it intercepts requests and responses, and how it can be used for authentication, logging, and other common tasks.",
        "title": "Express Middleware",
        "embed": "https://www.youtube.com/embed/n2c0mf1sza4",
        "duration": 1190
      },
      {
        "notes": "Explore HTTP headers in API contexts, understanding their role in communication, common header types, and how they can be used for authentication, content negotiation, and other purposes.",
        "title": "What are HTTP Headers in API",
        "embed": "https://www.youtube.com/embed/mhg3Vwsb88M",
        "duration": 1058
      },
      {
        "notes": "Learn about HTTP status codes, understanding their meanings, how they are used to indicate the outcome of API requests, and how they help developers handle responses effectively.",
        "title": "HTTP Status Codes",
        "embed": "https://www.youtube.com/embed/fLGw2GK884s",
        "duration": 936
      },
      {
        "notes": "Get started with MongoDB, a popular NoSQL database, understanding its key concepts, document-oriented structure, and how it differs from relational databases.",
        "title": "Getting Started with MongoDB",
        "embed": "https://www.youtube.com/embed/oH0VoYiA8_s",
        "duration": 481
      },
      {
        "notes": "Learn how to connect Node.js applications to MongoDB databases using Mongoose, a powerful ODM (Object Document Mapper), enabling seamless interactions with the database.",
        "title": "Connecting NodeJS with MongoDB | Mongoose + Express",
        "embed": "https://www.youtube.com/embed/xrglM8U0Zv8",
        "duration": 1158
      },
      {
        "notes": "Understand the Model-View-Controller (MVC) pattern, its benefits for structuring applications, and how to implement it effectively in Node.js projects.",
        "title": "Model View Controller in NodeJS | MVC Pattern",
        "embed": "https://www.youtube.com/embed/JLtXoru-ipo",
        "duration": 1381
      },
      {
        "notes": "Build a custom URL shortener application using Node.js and MongoDB, learning about database design, URL manipulation, and implementing a real-world application.",
        "title": "Create a Custom URL Shortener using Node.JS and MongoDB",
        "embed": "https://www.youtube.com/embed/4WvX9dBjiJo",
        "duration": 1390
      },
      {
        "notes": "Explore Server-Side Rendering (SSR) with EJS and Node.js, understanding how to generate HTML on the server, improve SEO, and enhance user experience.",
        "title": "Server Side Rendering with EJS and Node.JS",
        "embed": "https://www.youtube.com/embed/yy9cbu_e3Xg",
        "duration": 1524
      },
      {
        "notes": "Implement secure authentication mechanisms for your Node.js applications from scratch, covering user registration, login, password hashing, and session management.",
        "title": "Building Node.js Authentication from Scratch",
        "embed": "https://www.youtube.com/embed/OWeruyqhiTo",
        "duration": 2349
      },
      {
        "notes": "Learn about JWT (JSON Web Token) authentication, understanding its principles, how it works, and how to implement secure JWT-based authentication in Node.js applications.",
        "title": "JWT Authentication in NodeJS",
        "embed": "https://www.youtube.com/embed/mGrVmEex6_g",
        "duration": 870
      },
      {
        "notes": "Explore cookies in Node.js, understanding their purpose, how they are used for session management, and how to handle cookies securely in web applications.",
        "title": "What are Cookies in NodeJS?",
        "embed": "https://www.youtube.com/embed/kMErso06vHo",
        "duration": 1835
      },
      {
        "notes": "Understand the concept of authorization in Node.js, learning how to control access to resources based on user roles, permissions, and other factors.",
        "title": "Authorization in NodeJS",
        "embed": "https://www.youtube.com/embed/1uxWtBFOrkk",
        "duration": 1173
      },
      {
        "notes": "Create a Discord bot using Node.js, exploring the Discord API, event handling, command processing, and how to interact with the Discord platform.",
        "title": "Creating Discord Bot in NodeJS",
        "embed": "https://www.youtube.com/embed/5UOMuTWrh6Q",
        "duration": 1305
      },
      {
        "notes": "Learn how to upload files in Node.js applications using Multer, a popular middleware for handling file uploads, covering file storage, validation, and error handling.",
        "title": "Uploading Files with NodeJS and Multer",
        "embed": "https://www.youtube.com/embed/WqJ0P8JnftI",
        "duration": 851
      },
      {
        "notes": "Set up the foundation for a Node.js blogging application with MongoDB, including database schema design, user models, and basic post creation functionality.",
        "title": "Setting Up Project - NodeJS Blogging Application with MongoDB",
        "embed": "https://www.youtube.com/embed/6z6CR29gtds",
        "duration": 2376
      },
      {
        "notes": "Implement authentication for your Node.js blogging application using MongoDB, securing user accounts, managing logins, and ensuring data privacy.",
        "title": "Setting up Authentication  - NodeJS Blogging Application with MongoDB",
        "embed": "https://www.youtube.com/embed/X1AGH8Byj9Y",
        "duration": 2301
      },
      {
        "notes": "Complete the development of a full-featured Node.js blogging application, integrating MongoDB for data persistence and EJS for templating.",
        "title": "Complete Blog App - NodeJS, MongoDB and EJS",
        "embed": "https://www.youtube.com/embed/vnWVrjsEeAM",
        "duration": 1589
      },
      {
        "notes": "Deploy your Node.js application to Amazon Web Services (AWS), understanding the benefits of cloud deployment, configuring AWS infrastructure, and deploying your application.",
        "title": "Deploy NodeJS Application on AWS - Amazon Web Services | NodeJS",
        "embed": "https://www.youtube.com/embed/_U0pTlpyMGg",
        "duration": 1191
      },
      {
        "notes": "Explore WebSocket communication in Node.js using Socket.IO, enabling real-time messaging and interactive applications, understanding the benefits of WebSocket over HTTP.",
        "title": "WebSocket in NodeJS | Socket.IO - Real Time Messaging",
        "embed": "https://www.youtube.com/embed/UUddpbgPEJM",
        "duration": 1947
      },
      {
        "notes": "Learn about Node.js streams, understanding their purpose, how they enable efficient data processing, and how to use them for file handling, network communication, and other tasks.",
        "title": "NodeJS Streams",
        "embed": "https://www.youtube.com/embed/64LJJhT6Ybo",
        "duration": 926
      },
      {
        "notes": "Discover how to scale Node.js applications using the cluster module, leveraging multi-core processors to improve performance and handle large workloads.",
        "title": "How to scale NodeJs applications using the cluster module.",
        "embed": "https://www.youtube.com/embed/JoPZ9gEvpz8",
        "duration": 758
      },
      {
        "notes": "Get introduced to Nginx, a powerful web server and reverse proxy, understanding its capabilities for load balancing, caching, and enhancing web application performance.",
        "title": "What is Nginx?",
        "embed": "https://www.youtube.com/embed/b_B1BEShfBc",
        "duration": 705
      },
      {
        "notes": "Learn how to install and configure Nginx on your system, setting up the web server and configuring its basic settings for serving web content.",
        "title": "Install and Setup Nginx",
        "embed": "https://www.youtube.com/embed/Qmld1te08Ns",
        "duration": 796
      },
      {
        "notes": "Understand how to serve static content using Nginx, configure file serving rules, and optimize web server performance for delivering static files efficiently.",
        "title": "Serve Static Content with Nginx",
        "embed": "https://www.youtube.com/embed/YkuhqIDUi2A",
        "duration": 901
      },
      {
        "notes": "Explore a complete deployment workflow for Node.js applications using Nginx as a reverse proxy, setting up SSL with Let's Encrypt for secure communication.",
        "title": "Full Node.js Deployment - NGINX, SSL With Lets Encrypt",
        "embed": "https://www.youtube.com/embed/ofBFl4M4BFk",
        "duration": 1885
      },
      {
        "notes": "Learn about the Serverless framework and its benefits for building and deploying serverless applications using Node.js, understanding the advantages of serverless architecture.",
        "title": "Serverless Framework with NodeJS",
        "embed": "https://www.youtube.com/embed/VvYADzRwJK8",
        "duration": 1246
      },
      {
        "notes": "Explore the concept of serverless computing, comparing serverless and monolithic architectures, and understanding how AWS Lambda works as a serverless platform.",
        "title": "What is Serverless? | Serverless Vs Monolith | AWS Lambda",
        "embed": "https://www.youtube.com/embed/AgOmeANl3ls",
        "duration": 2171
      },
      {
        "notes": "Dive into GraphQL, a query language for APIs, understanding its benefits over REST APIs, learning about schema definition, query syntax, and resolving data.",
        "title": "GraphQL Crash Course - GraphQL NodeJS",
        "embed": "https://www.youtube.com/embed/WtkKwO1viI8",
        "duration": 2551
      },
      {
        "notes": "Build the backend architecture for a Threads application clone using GraphQL, designing the schema, defining resolvers, and implementing core functionality.",
        "title": "Threads App GraphQL Clone | Backend Architecture",
        "embed": "https://www.youtube.com/embed/FbDrEEhG5cM",
        "duration": 1134
      },
      {
        "notes": "Set up a GraphQL server using Node.js, including installation, schema definition, and connecting to a database, exploring different GraphQL libraries and tools.",
        "title": "Setting up Graphql Server | Complete GraphQL Series",
        "embed": "https://www.youtube.com/embed/g6YpoVYTd1s",
        "duration": 1501
      },
      {
        "notes": "Learn how to integrate Prisma with a PostgreSQL database in your GraphQL server, leveraging its ORM (Object Relational Mapper) for database interactions.",
        "title": "Graphql Prisma Postgresql Setup | Complete GraphQL Series",
        "embed": "https://www.youtube.com/embed/4jiTZGn34_c",
        "duration": 1047
      },
      {
        "notes": "Refactor your GraphQL code for better organization and maintainability, applying best practices, using directives, and optimizing for performance.",
        "title": "Refactoring GraphQL Code | Complete GraphQL Series",
        "embed": "https://www.youtube.com/embed/MSJImC6cTkY",
        "duration": 755
      },
      {
        "notes": "Implement authentication in your GraphQL server, securing endpoints, managing user sessions, and verifying user credentials.",
        "title": "Authentication with GraphQL Server | Complete GraphQL Series",
        "embed": "https://www.youtube.com/embed/0XFoeaYnc20",
        "duration": 1300
      },
      {
        "notes": "Explore JWT authentication within the context of GraphQL, understanding how to integrate JWTs into your schema, create a secure context, and manage user data.",
        "title": "JWT Authentication and Context in GraphQL",
        "embed": "https://www.youtube.com/embed/8atiBUsAOcI",
        "duration": 817
      }
    ],
    "name": "Mastering Node.js",
    "overview": "This comprehensive course will guide you through the fundamentals of Node.js, teaching you how to build server-side applications, REST APIs, and explore advanced concepts like authentication, websockets, and serverless deployments."
  },
  "author": "Piyush Garg",
  "channel": "https://www.youtube.com/channel/UCf9T51_FmMlfhiGpoes0yFA",
  "duration": 57841
}
