{"course":{"lectures":[{"description":"This lecture will cover the fundamental concepts of Python variables and data types. Learn how to assign values to variables, understand different types of data, and perform basic operations on them.","title":"Python Full Course❤️ | Variables & Data Types | Lecture 1","embed":"https://www.youtube.com/embed/t2_Q2BRzeEE","duration":4939},{"description":"This lecture will introduce you to strings in Python, including how to work with text data, perform string manipulations, and use conditional statements to control the flow of your programs.","title":"Lecture 2 : Strings & Conditional Statements | Python Full Course","embed":"https://www.youtube.com/embed/lIId8IDP6TU","duration":3341},{"description":"This lecture explores Python's powerful data structures, lists and tuples. Learn how to create, manipulate, and access elements within lists and tuples, and understand their differences and applications.","title":"Lecture 3 : List & Tuple in Python | Python Full Course","embed":"https://www.youtube.com/embed/qVyvmzFxF_o","duration":2506},{"description":"Dive into dictionaries and sets in Python! Learn how to store and access key-value pairs in dictionaries and work with unordered collections of unique elements in sets.","title":"Lecture 4 : Dictionary & Set in Python | Python Full Course","embed":"https://www.youtube.com/embed/078tYSD7K8E","duration":3272},{"description":"This lecture explores different loop constructs in Python, including while loops and for loops, to automate repetitive tasks and iterate over data structures. Learn how to control the flow of your programs using loops.","title":"Lecture 5 : Loops in Python | While & For Loops | Python Full Course","embed":"https://www.youtube.com/embed/S73thl0AyFU","duration":3831},{"description":"This lecture delves into functions and recursion in Python. Learn how to define functions to encapsulate reusable code blocks, understand the concept of recursion, and explore its applications in solving problems.","title":"Lecture 6 : Functions & Recursion in Python | Python Full Course","embed":"https://www.youtube.com/embed/OvTH-7ESoRA","duration":3708},{"description":"Explore file input and output operations in Python, enabling you to read data from files, write data to files, and interact with external data sources.","title":"Lecture 7 : File Input/Output in Python | Python Full Course","embed":"https://www.youtube.com/embed/jU0cndZziO0","duration":3048},{"description":"This lecture introduces you to the fundamentals of object-oriented programming (OOP) in Python, including the concepts of classes, objects, and how to create and interact with them.","title":"Lecture 8 : OOPS in Python | Object Oriented Programming | Classes & Objects | Python Full Course","embed":"https://www.youtube.com/embed/HeW-D6KpDwY","duration":3400},{"description":"Continue your OOP journey by delving deeper into advanced concepts such as inheritance, polymorphism, and encapsulation, enhancing your understanding of object-oriented design principles.","title":"Lecture 9 : OOPS Part 2 | Object Oriented Programming | Python Full Course","embed":"https://www.youtube.com/embed/bAwmZVJeO5s","duration":4146}],"name":"Python Fundamentals","overview":"A comprehensive introduction to Python programming, covering essential concepts, data structures, control flow, object-oriented programming, and more. This course is perfect for beginners and anyone wanting to learn Python from scratch.","category":"programming","level":"beginner"},"author":"Shradha Khapra","channel":"https://www.youtube.com/channel/UC1XBh-m27kkgwLAwu_SRJBg","duration":32191}