{"course":{"lectures":[{"description":"This lecture introduces Node.js, a powerful JavaScript runtime environment, and explains its core concepts. It covers the fundamental advantages of Node.js, such as its event-driven architecture and non-blocking I/O model, making it ideal for building scalable and efficient applications. You'll learn about the Node.js package manager (npm) and its role in managing dependencies.","title":"What is NodeJS?","embed":"https://www.youtube.com/embed/ohIAiuHMKMI","duration":465},{"description":"This lecture guides you through the process of installing Node.js on your computer. It covers the steps involved in downloading the appropriate installer, configuring your system, and verifying the installation. You'll learn about different options for installing Node.js and how to choose the best approach for your environment.","title":"Node JS Installation","embed":"https://www.youtube.com/embed/N6PjgN9licA","duration":362},{"description":"This lecture walks you through creating your first Node.js program, the classic \"Hello World\" example. You'll learn how to execute Node.js scripts, understand the basic syntax, and explore the concept of the `console.log()` function for outputting data. This hands-on session lays the foundation for working with Node.js.","title":"Hello World NodeJS","embed":"https://www.youtube.com/embed/XhCs5cTYW_8","duration":585},{"description":"This lecture dives into the concept of modules in Node.js, a fundamental building block for organizing and reusing code. You'll learn about core modules, custom modules, and how to import and export functionality.  The lecture explains how to leverage modules to create well-structured and modular applications.","title":"Modules in NodeJS","embed":"https://www.youtube.com/embed/FSRo41TaHFU","duration":925},{"description":"This lecture focuses on file handling in Node.js, a crucial skill for interacting with the file system. You'll learn how to read, write, and manipulate files using built-in Node.js modules.  The lecture covers various file operations, including creating, deleting, and renaming files, as well as working with directories.","title":"File Handling in NodeJS","embed":"https://www.youtube.com/embed/YazJFb_i4A0","duration":1097},{"description":"This lecture sheds light on the inner workings of Node.js. You'll explore the event loop, the core of Node.js's asynchronous nature, and understand how it handles multiple requests efficiently. The lecture clarifies how Node.js manages concurrency and provides insights into its non-blocking I/O model.","title":"How NodeJS Works?","embed":"https://www.youtube.com/embed/y0aTs56DJWk","duration":863},{"description":"This lecture teaches you how to build your first HTTP server using Node.js. You'll learn the fundamentals of HTTP protocol and how to create a basic server that can handle incoming requests and respond with data. The lecture covers creating routes, handling GET and POST requests, and sending responses.","title":"Building HTTP Server in NodeJS","embed":"https://www.youtube.com/embed/ZQsrcayZcSk","duration":1076},{"description":"This lecture explores URL handling in Node.js, a key aspect of web applications. You'll learn how to parse URLs, extract parameters, and work with query strings. The lecture covers routing techniques and how to create dynamic web applications by analyzing URL components.","title":"Handling URL's in NodeJS","embed":"https://www.youtube.com/embed/Nt-AsZh5woE","duration":1237},{"description":"This lecture covers the essential HTTP methods used for web communication, including GET, POST, PUT, DELETE, and PATCH. You'll understand the purpose of each method and how they are used to interact with web servers. The lecture clarifies the differences between these methods and how to implement them in your Node.js applications.","title":"HTTP METHODS","embed":"https://www.youtube.com/embed/kREAjKyPbSI","duration":818},{"description":"This lecture introduces Express.js, a popular web framework for Node.js, and guides you through setting up your first Express application. You'll learn the advantages of using Express.js, such as its routing system, middleware, and template engine support. This lecture lays the foundation for building robust web applications with Express.js.","title":"Getting Started with Express and NodeJS","embed":"https://www.youtube.com/embed/N2-FyBBxOZA","duration":688},{"description":"This lecture delves into the concept of versioning in Node.js, a crucial aspect for maintaining consistency and backward compatibility. You'll learn how to manage different versions of your Node.js applications, ensuring that they work seamlessly with various environments and dependencies. The lecture covers best practices for versioning and using tools like nvm.","title":"How Versioning Works in NodeJS?","embed":"https://www.youtube.com/embed/ORmB_ABimjM","duration":1270},{"description":"This lecture introduces REST APIs (Representational State Transfer Application Programming Interfaces), a widely used architectural style for building web services. You'll learn the principles of REST APIs, including resources, methods, and statelessness. The lecture covers the benefits of using REST APIs for building flexible and scalable applications.","title":"What is REST API?","embed":"https://www.youtube.com/embed/cJAyEOZQUQY","duration":941},{"description":"This lecture provides a practical guide to building REST APIs using Node.js and Express.js. You'll learn how to create routes, handle requests, and return JSON data. The lecture demonstrates how to implement CRUD (Create, Read, Update, Delete) operations for different resources using Express.js.","title":"Building REST API's using Node and Express.js","embed":"https://www.youtube.com/embed/uNCrMvkPUAE","duration":1227},{"description":"This lecture introduces Postman, a popular tool for testing and interacting with REST APIs. You'll learn how to use Postman to send requests, inspect responses, and manage API documentation.  The lecture covers essential Postman features and how to leverage it for efficient API development.","title":"Introduction to POSTMAN for REST API's","embed":"https://www.youtube.com/embed/7OzNVIxPLH0","duration":889},{"description":"This lecture explores Express middleware, a powerful feature for extending the functionality of your Express applications. You'll learn how to create custom middleware to handle tasks like authentication, logging, and error handling. The lecture covers different types of middleware and their use cases.","title":"Express Middleware","embed":"https://www.youtube.com/embed/n2c0mf1sza4","duration":1190},{"description":"This lecture explains the role of HTTP headers in API communication. You'll learn about different header types, such as Content-Type, Authorization, and Cache-Control, and how they convey information between clients and servers. The lecture covers best practices for using HTTP headers in API development.","title":"What are HTTP Headers in API","embed":"https://www.youtube.com/embed/mhg3Vwsb88M","duration":1058},{"description":"This lecture covers HTTP status codes, essential for communicating the outcome of API requests. You'll learn about common status codes like 200 (OK), 404 (Not Found), and 500 (Internal Server Error), and how to interpret them. The lecture provides guidance on using status codes effectively in API development.","title":"HTTP Status Codes","embed":"https://www.youtube.com/embed/fLGw2GK884s","duration":936},{"description":"This lecture introduces MongoDB, a popular NoSQL database, and its key concepts. You'll learn about document-oriented databases, how to work with collections and documents, and the benefits of using MongoDB for building dynamic applications. The lecture covers basic MongoDB commands and operations.","title":"Getting Started with MongoDB","embed":"https://www.youtube.com/embed/oH0VoYiA8_s","duration":481},{"description":"This lecture guides you through connecting your Node.js application to a MongoDB database using the Mongoose library, a popular ORM for MongoDB. You'll learn how to define models, interact with documents, and implement CRUD operations using Mongoose and Express.js. The lecture covers setting up the connection and performing basic database operations.","title":"Connecting NodeJS with MongoDB | Mongoose + Express","embed":"https://www.youtube.com/embed/xrglM8U0Zv8","duration":1158},{"description":"This lecture explores the Model-View-Controller (MVC) pattern, a widely used architectural pattern for organizing web applications. You'll learn how to implement MVC in Node.js using Express.js and EJS (Embedded JavaScript Templates). The lecture covers separating concerns, managing data flow, and creating dynamic web pages using MVC.","title":"Model View Controller in NodeJS | MVC Pattern","embed":"https://www.youtube.com/embed/JLtXoru-ipo","duration":1381},{"description":"This lecture provides a hands-on tutorial for creating a custom URL shortener application using Node.js and MongoDB. You'll learn how to create a database to store URLs, implement shortening logic, and build a user interface for interacting with the application.  The lecture covers database design, data validation, and user experience.","title":"Create a Custom URL Shortener using Node.JS and MongoDB","embed":"https://www.youtube.com/embed/4WvX9dBjiJo","duration":1390},{"description":"This lecture introduces Server-Side Rendering (SSR) with EJS and Node.js. You'll learn how to render HTML content on the server, improving SEO and performance. The lecture covers how to use EJS templates, dynamically generate HTML, and send rendered content to the browser.","title":"Server Side Rendering with EJS and Node.JS","embed":"https://www.youtube.com/embed/yy9cbu_e3Xg","duration":1524},{"description":"This lecture provides a comprehensive guide to building authentication systems from scratch using Node.js. You'll learn about secure password hashing, session management, user registration, and login functionality. The lecture emphasizes security best practices and demonstrates how to implement a robust authentication system.","title":"Building Node.js Authentication from Scratch","embed":"https://www.youtube.com/embed/OWeruyqhiTo","duration":2349},{"description":"This lecture covers JWT (JSON Web Token) authentication, a popular and secure method for user authentication in Node.js. You'll learn about the structure of JWTs, how to generate and verify tokens, and how to implement JWT authentication in your applications. The lecture covers secure token handling and best practices.","title":"JWT Authentication in NodeJS","embed":"https://www.youtube.com/embed/mGrVmEex6_g","duration":870},{"description":"This lecture explains the concept of cookies in Node.js, a mechanism for storing user information on the client-side. You'll learn how to create, send, and manage cookies in your Node.js applications. The lecture covers different types of cookies, secure cookie handling, and best practices for using cookies.","title":"What are Cookies in NodeJS?","embed":"https://www.youtube.com/embed/kMErso06vHo","duration":1835},{"description":"This lecture explores authorization in Node.js, the process of controlling access to resources based on user roles and permissions. You'll learn how to implement role-based access control (RBAC) and fine-grained authorization using middleware and security libraries. The lecture covers best practices for secure authorization.","title":"Authorization in NodeJS","embed":"https://www.youtube.com/embed/1uxWtBFOrkk","duration":1173},{"description":"This lecture guides you through creating your first Discord bot using Node.js. You'll learn how to interact with the Discord API, handle events, and build custom bot functionality. The lecture covers setting up a Discord bot, receiving commands, and responding to user interactions.","title":"Creating Discord Bot in NodeJS","embed":"https://www.youtube.com/embed/5UOMuTWrh6Q","duration":1305},{"description":"This lecture teaches you how to upload files to your Node.js server using the Multer library. You'll learn how to handle file uploads, validate file types, and store files securely. The lecture covers setting up Multer, handling form submissions, and accessing uploaded files.","title":"Uploading Files with NodeJS and Multer","embed":"https://www.youtube.com/embed/WqJ0P8JnftI","duration":851},{"description":"This lecture sets the foundation for building a Node.js blogging application using MongoDB. You'll learn how to structure your project, set up the database, and define basic models for posts, users, and comments. The lecture covers project organization, data modeling, and database setup.","title":"Setting Up Project - NodeJS Blogging Application with MongoDB","embed":"https://www.youtube.com/embed/6z6CR29gtds","duration":2376},{"description":"This lecture builds upon the previous lecture, adding authentication to your blogging application. You'll learn how to implement user registration, login, and password management. The lecture covers secure password hashing, session management, and integrating authentication into your application.","title":"Setting up Authentication  - NodeJS Blogging Application with MongoDB","embed":"https://www.youtube.com/embed/X1AGH8Byj9Y","duration":2301},{"description":"This lecture completes the Node.js blogging application, adding features like post creation, editing, and commenting. You'll learn how to integrate EJS templates for dynamic content rendering and create a user-friendly interface. The lecture covers data retrieval, form processing, and front-end development.","title":"Complete Blog App - NodeJS, MongoDB and EJS","embed":"https://www.youtube.com/embed/vnWVrjsEeAM","duration":1589},{"description":"This lecture covers deploying your Node.js application to AWS (Amazon Web Services). You'll learn about different AWS services like EC2, S3, and Elastic Beanstalk, and how to configure them for hosting your application. The lecture covers deploying your application, managing resources, and scaling your application on AWS.","title":"Deploy NodeJS Application on AWS - Amazon Web Services | NodeJS","embed":"https://www.youtube.com/embed/_U0pTlpyMGg","duration":1191},{"description":"This lecture introduces WebSockets in Node.js using Socket.IO, a library for real-time communication. You'll learn how to establish persistent connections between clients and servers, enabling real-time messaging and updates. The lecture covers setting up Socket.IO, handling events, and implementing real-time functionality.","title":"WebSocket in NodeJS | Socket.IO - Real Time Messaging","embed":"https://www.youtube.com/embed/UUddpbgPEJM","duration":1947},{"description":"This lecture explores Node.js Streams, a powerful mechanism for processing data in chunks, enhancing performance and efficiency. You'll learn about different stream types, how to read and write data to streams, and how to use streams for tasks like file processing and network communication.","title":"NodeJS Streams","embed":"https://www.youtube.com/embed/64LJJhT6Ybo","duration":926},{"description":"This lecture delves into scaling Node.js applications using the `cluster` module. You'll learn how to leverage multiple CPU cores to handle concurrent requests and improve application performance. The lecture covers setting up a cluster, managing worker processes, and distributing workload across multiple cores.","title":"How to scale NodeJs applications using the cluster module.","embed":"https://www.youtube.com/embed/JoPZ9gEvpz8","duration":758},{"description":"This lecture introduces Nginx, a popular web server and reverse proxy, and its core concepts. You'll learn about the benefits of using Nginx, such as its high performance, load balancing, and static content serving capabilities. The lecture covers the architecture of Nginx and its use cases.","title":"What is Nginx?","embed":"https://www.youtube.com/embed/b_B1BEShfBc","duration":705},{"description":"This lecture guides you through the process of installing and setting up Nginx on your system. You'll learn how to download and install Nginx, configure its basic settings, and start the server. The lecture covers different installation methods and configuration options for Nginx.","title":"Install and Setup Nginx","embed":"https://www.youtube.com/embed/Qmld1te08Ns","duration":796},{"description":"This lecture demonstrates how to use Nginx to serve static content, such as HTML files, images, and CSS. You'll learn about different configuration directives for handling static files, customizing content delivery, and optimizing performance. The lecture covers serving static content from different locations.","title":"Serve Static Content with Nginx","embed":"https://www.youtube.com/embed/YkuhqIDUi2A","duration":901},{"description":"This lecture provides a comprehensive guide to deploying a Node.js application using Nginx, SSL with Let's Encrypt, and other essential components. You'll learn how to configure Nginx as a reverse proxy, set up SSL certificates using Let's Encrypt, and optimize your deployment for security and performance.","title":"Full Node.js Deployment - NGINX, SSL With Lets Encrypt","embed":"https://www.youtube.com/embed/ofBFl4M4BFk","duration":1885},{"description":"This lecture introduces serverless frameworks and the concept of serverless computing. You'll learn about the benefits of using serverless frameworks, such as AWS Lambda, and how they simplify deployment and scaling. The lecture covers serverless architecture, function-as-a-service, and comparing serverless with traditional monolithic architectures.","title":"Serverless Framework with NodeJS","embed":"https://www.youtube.com/embed/VvYADzRwJK8","duration":1246},{"description":"This lecture delves deeper into serverless computing, exploring the differences between serverless and monolithic architectures. You'll learn about the key concepts of serverless, including AWS Lambda, and its advantages in terms of scalability, cost-effectiveness, and reduced infrastructure management. The lecture covers use cases for serverless and how to choose the right approach.","title":"What is Serverless? | Serverless Vs Monolith | AWS Lambda","embed":"https://www.youtube.com/embed/AgOmeANl3ls","duration":2171},{"description":"This lecture provides a crash course on GraphQL, a query language and runtime for APIs. You'll learn the basics of GraphQL, including its syntax, schema definition, and query execution. The lecture covers the advantages of using GraphQL over REST APIs, such as flexibility, type safety, and efficiency.","title":"GraphQL Crash Course - GraphQL NodeJS","embed":"https://www.youtube.com/embed/WtkKwO1viI8","duration":2551},{"description":"This lecture demonstrates how to build the backend architecture for a Threads app clone using GraphQL. You'll learn how to define the schema, create resolvers, and implement data fetching logic using GraphQL. The lecture covers designing the GraphQL API and connecting it to your data sources.","title":"Threads App GraphQL Clone | Backend Architecture","embed":"https://www.youtube.com/embed/FbDrEEhG5cM","duration":1134},{"description":"This lecture guides you through setting up a GraphQL server using Node.js and the Apollo Server library. You'll learn how to create a schema, implement resolvers, and configure the server to handle GraphQL requests. The lecture covers setting up the development environment and running your GraphQL server.","title":"Setting up Graphql Server | Complete GraphQL Series","embed":"https://www.youtube.com/embed/g6YpoVYTd1s","duration":1501},{"description":"This lecture explores how to integrate Prisma with your GraphQL server to manage database interactions using PostgreSQL. You'll learn how to define Prisma models, create schema mappings, and interact with your database using Prisma Client. The lecture covers setting up Prisma and connecting it to your GraphQL server.","title":"Graphql Prisma Postgresql Setup | Complete GraphQL Series","embed":"https://www.youtube.com/embed/4jiTZGn34_c","duration":1047},{"description":"This lecture focuses on refactoring GraphQL code for better organization and maintainability. You'll learn techniques for optimizing your GraphQL schema, resolvers, and data fetching logic. The lecture covers best practices for writing clean and efficient GraphQL code.","title":"Refactoring GraphQL Code | Complete GraphQL Series","embed":"https://www.youtube.com/embed/MSJImC6cTkY","duration":755},{"description":"This lecture covers implementing authentication in your GraphQL server using JWTs. You'll learn how to authenticate users, protect routes, and manage user sessions using JWTs. The lecture covers creating a secure authentication layer for your GraphQL server.","title":"Authentication with GraphQL Server | Complete GraphQL Series","embed":"https://www.youtube.com/embed/0XFoeaYnc20","duration":1300},{"description":"This lecture delves into JWT authentication and how to integrate it into your GraphQL server using context. You'll learn how to create a custom context, pass authentication data through it, and secure your GraphQL endpoints. The lecture covers best practices for secure JWT authentication in GraphQL.","title":"JWT Authentication and Context in GraphQL","embed":"https://www.youtube.com/embed/8atiBUsAOcI","duration":817}],"name":"Mastering Node.js: From Beginner to Advanced","overview":"This comprehensive course will guide you through the world of Node.js, covering everything from the fundamentals to advanced concepts like building REST APIs, GraphQL, and real-time applications. You'll learn how to write efficient and scalable code, deploy your applications to the cloud, and become a proficient Node.js developer.","category":"programming","level":"beginner"},"author":"Piyush Garg","channel":"https://www.youtube.com/channel/UCf9T51_FmMlfhiGpoes0yFA","duration":57841}