{"course":{"lectures":[{"description":"This lecture introduces the fundamental concepts of vectors and forces in physics, a crucial topic for JEE and NEET aspirants. We'll delve into the definition of vectors, their components, and different types of forces such as weight, normal force, and tension. Get ready to grasp the basics of vector addition, subtraction, and multiplication. This lecture is essential for understanding motion, equilibrium, and various other important concepts in physics.","title":"Vectors and Forces Class 11 | JEE/NEET | Physics | Lecture 1","embed":"https://www.youtube.com/embed/HjRLoWsqNf4","duration":8411},{"description":"This lecture delves into the concepts of weight and normal force, two essential forces that play a significant role in understanding the interaction between objects and their surroundings. We'll discuss the definition of weight as the force exerted by gravity on an object and explore how normal force arises as a reaction force to the weight of an object resting on a surface. This lecture is crucial for understanding static equilibrium and forces acting on objects.","title":"Weight & Normal Force Class 11 | JEE/NEET | Physics | Lecture 2","embed":"https://www.youtube.com/embed/xtpen4D56Uc","duration":4014},{"description":"This lecture expands upon the concept of forces by exploring pulleys and tension. Pulleys are simple machines that help change the direction of force and make lifting objects easier. We'll learn about the different types of pulleys and how tension plays a role in determining the force required to lift an object. This lecture is crucial for understanding mechanical advantage and work done by forces.","title":"Vectors and Forces Class 11 | JEE/NEET | Physics | Pulleys and Tension | Lecture 3","embed":"https://www.youtube.com/embed/xwFP0_S8_zc","duration":4698},{"description":"This lecture provides a comprehensive understanding of relative velocity, a concept fundamental to describing motion from different frames of reference. We'll explore how to calculate relative velocity in various scenarios, including when objects move in the same or opposite directions. This lecture is essential for understanding how motion appears differently to observers in different frames of reference.","title":"Relative Velocity Full Shot | JEE/NEET | Vectors and Forces - Lecture 4","embed":"https://www.youtube.com/embed/jD9_vu9kFo4","duration":14583},{"description":"This lecture introduces the important concepts of dot product and cross product, which are essential tools for working with vectors in physics and mathematics. We'll explore the properties and applications of dot product and cross product in determining the angle between vectors, calculating the magnitude of the projection of one vector onto another, and calculating the torque of a force. This lecture is essential for understanding the nature and properties of vectors.","title":"Scalar/Dot Product and Cross/Vector Product | One Shot | for JEE/NEET","embed":"https://www.youtube.com/embed/o4PsATiDSyQ","duration":5567},{"description":"This lecture focuses on solving crucial and challenging questions related to vectors and forces, providing valuable practice for JEE/NEET aspirants. We'll cover a wide range of problems related to finding resultant vectors, calculating the magnitude and direction of forces, and applying the concepts of dot product and cross product to solve real-world scenarios. This lecture is designed to help students solidify their understanding and develop problem-solving skills.","title":"Most Important Questions | for JEE/NEET | Vectors and Forces | Class 11","embed":"https://www.youtube.com/embed/y0ip8PCi3dk","duration":3931},{"description":"This is an important announcement for all JEE/NEET students, covering essential information and updates related to the preparation process. Stay tuned for crucial information regarding the exam pattern, syllabus, study strategies, and important resources. This lecture aims to keep students informed and motivated throughout their preparation journey.","title":"Suno suno : Imp Announcement for JEE/NEET students | Physics for Class 11 (Mechanics) ❤️","embed":"https://www.youtube.com/embed/8ZoXArgUfOs","duration":163}],"name":"Vectors & Forces for JEE/NEET","overview":"This course dives into the essential concepts of vectors and forces in physics, designed specifically for students preparing for JEE and NEET examinations. Covering topics like vector operations, weight, normal force, pulleys, tension, relative velocity, dot product, cross product, and solving challenging practice problems. This comprehensive course aims to provide a strong foundation in vectors and forces for achieving success in these competitive exams.","category":"mathematics","level":"intermediate"},"author":"Apni Kaksha Official","channel":"https://www.youtube.com/channel/UCF7BExjT2zH_mmyqOB139Dg","duration":41367}