{"course":{"lectures":[{"description":"This lecture introduces the fundamental concepts of statistics as they relate to data science. It covers the different types of data, methods of classifying data, and scales of measurement used in data analysis.","title":"Statistics for Data Science 1 - Introduction","embed":"https://www.youtube.com/embed/V5fqShLVpoI","duration":332},{"description":"This lecture provides a week-by-week overview of the course syllabus, outlining the key topics and learning objectives that will be covered.","title":"Introduction - Week wise of  the course","embed":"https://www.youtube.com/embed/8p9ZcNwqG58","duration":1734},{"description":"This lecture delves into the core concepts of data, exploring different types of data encountered in data science and defining essential terminology.","title":"Lecture 1.1 - Introduction and Types of Data - Basic definitions","embed":"https://www.youtube.com/embed/0w2rKt-G6ws","duration":877},{"description":"This lecture provides a comprehensive understanding of data, emphasizing the importance of context and interpretation in analyzing and utilizing data.","title":"Lecture 1.2 - Introduction and Types of Data - Understanding data","embed":"https://www.youtube.com/embed/PXYtFNTVeVY","duration":1960},{"description":"This lecture classifies data into various categories based on its characteristics, providing a framework for organizing and analyzing data effectively.","title":"Lecture 1.3 -  Introduction and Types of Data - Classification of data","embed":"https://www.youtube.com/embed/6w71IUzKz2o","duration":861},{"description":"This lecture explores different scales of measurement used to quantify data, enabling a deeper understanding of the nature and limitations of data.","title":"Lecture 1.4 - Introduction and Types of Data - Scales of measurement","embed":"https://www.youtube.com/embed/EVGVlzMuhIo","duration":1234},{"description":"This tutorial focuses on practical exercises related to the concepts covered in the first set of lectures, helping students solidify their understanding through hands-on practice.","title":"Tutorial 1 - Statistics for Data Science 1","embed":"https://www.youtube.com/embed/d8s_xA2Cg3w","duration":461},{"description":"This tutorial provides additional practice problems and exercises to reinforce the concepts covered in the previous lectures.","title":"Tutorial 2 - Statistics for Data Science 1","embed":"https://www.youtube.com/embed/wQYU9f1OvPw","duration":652},{"description":"This tutorial explores the use of spreadsheet formulas for manipulating and analyzing data, equipping students with practical skills in data management.","title":"Tutorial 3 - Spreadsheet formulae","embed":"https://www.youtube.com/embed/MQ5DgZo97Pg","duration":913},{"description":"This tutorial guides students through the process of downloading and uploading spreadsheets, enabling them to effectively manage and access data files.","title":"Tutorial 4 - Downloading and Uploading spreadsheets","embed":"https://www.youtube.com/embed/shwymxnbcqM","duration":490},{"description":"This lecture introduces the concept of frequency distributions for categorical data, providing a way to visualize and summarize data patterns.","title":"Lecture 2.1 - Describing Categorical Data - Frequency distributions","embed":"https://www.youtube.com/embed/0-PO41B6zL0","duration":1315},{"description":"This lecture explores various charts used to represent categorical data, enabling visual analysis and interpretation of data trends.","title":"Lecture 2.2 - Describing Categorical Data - Charts of categorical data","embed":"https://www.youtube.com/embed/OFDJTgEKLbE","duration":1413},{"description":"This lecture focuses on best practices for creating effective and informative graphs for categorical data, emphasizing clarity and accuracy.","title":"Lecture 2.3 - Describing Categorical Data - Best practices while graphing data - 1","embed":"https://www.youtube.com/embed/Peh-G_M6Two","duration":1070},{"description":"This lecture continues the discussion on best practices for creating data visualizations, providing further insights into design principles and ethical considerations.","title":"Lecture 2.4 - Describing Categorical Data - Best practices while graphing data - 2","embed":"https://www.youtube.com/embed/4MwZ2_iTkoo","duration":485},{"description":"This lecture introduces measures of central tendency for categorical data, specifically mode and median, providing a deeper understanding of data distribution.","title":"Lecture 2.5 - Describing Categorical Data - Mode and Median","embed":"https://www.youtube.com/embed/5Z8mhCgGkcE","duration":1952},{"description":"This tutorial provides practice problems related to creating charts and tables for analyzing categorical data.","title":"week 2 - Tutorial - 1 Problems Charts and Tables","embed":"https://www.youtube.com/embed/2-o31mFX8ps","duration":665},{"description":"This tutorial focuses on identifying and understanding misleading graphs, helping students develop critical thinking skills in data interpretation.","title":"week 2  - Tutorial - 2 Problems Misleading Graphs","embed":"https://www.youtube.com/embed/mQf9-ZBy2Fw","duration":251},{"description":"This tutorial explores the SUMIF function in Google Sheets, enabling students to efficiently calculate conditional sums in datasets.","title":"week 2  - Tutorial - 3  SUMIF in Google Sheets","embed":"https://www.youtube.com/embed/e2b9YpsHu_I","duration":313},{"description":"This tutorial introduces the VLOOKUP function in Google Sheets, providing students with a powerful tool for searching and retrieving specific data from tables.","title":"week 2 - Tutorial - 4 VLOOKUP in Google Sheets","embed":"https://www.youtube.com/embed/_oiLk-rXZuY","duration":844},{"description":"This video provides a comprehensive solution to the practice problems assigned for week 2, helping students understand the concepts and techniques discussed.","title":"Wk 2 Practice Solution Video","embed":"https://www.youtube.com/embed/6tVhPyo4l9U","duration":2568},{"description":"This lecture introduces the concept of frequency tables for numerical data, providing a method for summarizing and analyzing continuous data.","title":"Lecture 3.1 - Describing Numerical Data - Frequency Tables for numerical data","embed":"https://www.youtube.com/embed/wifCmIPaBqQ","duration":2025},{"description":"This lecture explores the mean as a measure of central tendency for numerical data, explaining its calculation and interpretation.","title":"Lecture 3.2  - Describing Numerical Data - Mean","embed":"https://www.youtube.com/embed/mT8jZkG9HjM","duration":1437},{"description":"This lecture introduces the median and mode as measures of central tendency for numerical data, emphasizing their relevance in understanding data distribution.","title":"Lecture 3.3 - Describing Numerical Data - Median and Mode","embed":"https://www.youtube.com/embed/2qTdQjFGA94","duration":1307},{"description":"This lecture explores measures of dispersion for numerical data, focusing on the range as a measure of variability.","title":"Lecture 3.4 - Describing Numerical Data - Measures of dispersion- Range","embed":"https://www.youtube.com/embed/Ju8cRGDTxsQ","duration":1939},{"description":"This lecture introduces percentiles, quartiles, and the interquartile range as measures of data distribution, providing a deeper understanding of data variability.","title":"Lecture 3.5 - Describing Numerical Data - Percentiles, Quartiles, and Interquartile range","embed":"https://www.youtube.com/embed/3pjSpNbas14","duration":1605},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on describing numerical data.","title":"Week 3 - Tutorial 1","embed":"https://www.youtube.com/embed/PkKWQOOzLms","duration":376},{"description":"This tutorial continues with practice problems related to describing numerical data, reinforcing the concepts discussed.","title":"Week 3 - Tutorial 2","embed":"https://www.youtube.com/embed/9fG6iTtoyLU","duration":207},{"description":"This tutorial provides further practice exercises related to describing numerical data, helping students solidify their understanding.","title":"Week 3 - Tutorial 3","embed":"https://www.youtube.com/embed/Ip5CueTv2tw","duration":256},{"description":"This tutorial focuses on specific aspects of describing numerical data, providing additional guidance and examples.","title":"Week 3 - Tutorial 4","embed":"https://www.youtube.com/embed/QMei8SUVSAY","duration":351},{"description":"This tutorial explores different techniques for analyzing numerical data, providing practical applications and insights.","title":"Week 3 - Tutorial 5","embed":"https://www.youtube.com/embed/DHzlNhbt1bY","duration":502},{"description":"This tutorial provides additional practice problems related to describing numerical data, enhancing student comprehension.","title":"Week 3 - Tutorial 6","embed":"https://www.youtube.com/embed/JZFDkZ5d4p4","duration":151},{"description":"This tutorial covers a range of topics related to describing numerical data, providing a comprehensive overview.","title":"Week 3 - Tutorial 7","embed":"https://www.youtube.com/embed/fxkZW_yWE1I","duration":279},{"description":"This tutorial focuses on creating box plots, a visual representation of data distribution, helping students understand the key features of numerical data.","title":"Week 3 - Box plot Tutorial","embed":"https://www.youtube.com/embed/-zYnDBac0UY","duration":456},{"description":"This video provides a comprehensive solution to the practice problems assigned for week 3, helping students understand the concepts and techniques discussed.","title":"W3PFinalVideo","embed":"https://www.youtube.com/embed/Jwyanoilukk","duration":3042},{"description":"This provides solutions to the graded assignment for Week 3, helping students understand the concepts and techniques discussed.","title":"Week 3 - Graded Assignment Solution","embed":"https://www.youtube.com/embed/SayWVPjZsy4","duration":1795},{"description":"This lecture provides a review of the course material, emphasizing key concepts and techniques covered so far.","title":"Lecture 4.1 - Association between two variables - Review of course","embed":"https://www.youtube.com/embed/XNPfcrDA75Y","duration":318},{"description":"This lecture introduces the concept of association between two categorical variables, exploring different methods for analyzing relationships between categorical data.","title":"Lecture 4.2 - Association between two categorical variables - Introduction","embed":"https://www.youtube.com/embed/iG9ATr_t_ZE","duration":1564},{"description":"This lecture explores the use of relative frequencies to analyze the association between two categorical variables, providing a measure of the strength of the relationship.","title":"Lecture 4.3 - Association between two categorical variables - Relative frequencies","embed":"https://www.youtube.com/embed/hVC1JYKyusw","duration":2108},{"description":"This lecture introduces scatterplots as a visual tool for examining the relationship between two numerical variables, highlighting patterns and trends.","title":"Lecture 4.4 - Association between two numerical variables - Scatterplot","embed":"https://www.youtube.com/embed/38019YAFyN8","duration":971},{"description":"This lecture explores different ways to describe the association between two numerical variables, including the direction and strength of the relationship.","title":"Lecture 4.5 - Association between two numerical variables - Describing association","embed":"https://www.youtube.com/embed/mueMrzFnM2Y","duration":642},{"description":"This lecture introduces the concept of covariance as a measure of the joint variability between two numerical variables, providing insights into the direction and strength of their relationship.","title":"Lecture 4.6 - Association between two numerical variables - Covariance","embed":"https://www.youtube.com/embed/0UcFJnqx6S0","duration":2186},{"description":"This lecture introduces the concept of correlation as a standardized measure of the linear association between two numerical variables, ranging from -1 to 1.","title":"Lecture 4.7 - Association between two numerical variables - Correlation","embed":"https://www.youtube.com/embed/v0CaodTv8zw","duration":1686},{"description":"This lecture explores how to fit a line to a scatterplot, providing a visual representation of the linear relationship between two numerical variables.","title":"Lecture 4.8  - Association between two numerical variables - Fitting a line","embed":"https://www.youtube.com/embed/1-9_vRZV-ck","duration":897},{"description":"This lecture examines the association between categorical and numerical variables, exploring different methods for analyzing the relationship between these two types of data.","title":"Lecture 4.9 - Association between categorical and numerical variables","embed":"https://www.youtube.com/embed/0q40C-Qu5TE","duration":1382},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on the association between two variables.","title":"Week  4 - Tutorial 1","embed":"https://www.youtube.com/embed/xvV7gJtel2Y","duration":447},{"description":"This tutorial continues with practice problems related to the association between two variables, reinforcing the concepts discussed.","title":"Week 4 - Tutorial 2","embed":"https://www.youtube.com/embed/DMMlyOqGoIE","duration":815},{"description":"This tutorial provides further practice exercises related to the association between two variables, helping students solidify their understanding.","title":"Week 4 - Tutorial 3","embed":"https://www.youtube.com/embed/_WqOOAjHgGI","duration":199},{"description":"This tutorial focuses on specific aspects of the association between two variables, providing additional guidance and examples.","title":"Week 4 - Tutorial 4","embed":"https://www.youtube.com/embed/3emHGA7-YMk","duration":814},{"description":"This provides solutions to the practice assignment for Week 4, helping students understand the concepts and techniques discussed.","title":"Week4 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/253X0ThDtko","duration":5921},{"description":"This lecture introduces the fundamental principles of counting, laying the groundwork for understanding permutations and combinations.","title":"Lecture 5.1 - Permutations and Combinations - Basic Principles of counting","embed":"https://www.youtube.com/embed/TeARzjZMra0","duration":1367},{"description":"This lecture explores the concept of factorials, providing a powerful tool for calculating the number of arrangements for a set of objects.","title":"Lecture 5.2 - Permutations and Combinations - Factorials","embed":"https://www.youtube.com/embed/kV1nGXR7c0I","duration":935},{"description":"This lecture defines permutations as arrangements of distinct objects, explaining different formulas for calculating permutations based on different scenarios.","title":"Lecture 5.3 - Permutations and Combinations - Permutations: Distinct objects","embed":"https://www.youtube.com/embed/7qSuq3jUxwY","duration":2330},{"description":"This lecture explores permutations involving objects that are not distinct, providing formulas and examples for calculating arrangements where objects are indistinguishable.","title":"Lecture 5.4 - Permutations and Combinations - Permutations : Objects not distinct","embed":"https://www.youtube.com/embed/Zrhz44TVc14","duration":2053},{"description":"This lecture introduces the concept of combinations, focusing on selecting a subset of objects from a larger set, regardless of order.","title":"Lecture 5.5 - Permutations and Combinations - Combinations","embed":"https://www.youtube.com/embed/s-cKQV5UwTU","duration":2284},{"description":"This lecture provides various applications of permutations and combinations in real-world scenarios, demonstrating their usefulness in problem-solving.","title":"Lecture 5.6 - Permutations and Combinations - Applications","embed":"https://www.youtube.com/embed/aE9yBQ9BWhQ","duration":1219},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on permutations and combinations.","title":"week 5 Tutorial 1","embed":"https://www.youtube.com/embed/SAYBziO5vUQ","duration":250},{"description":"This tutorial continues with practice problems related to permutations and combinations, reinforcing the concepts discussed.","title":"week 5 Tutorial 2","embed":"https://www.youtube.com/embed/dXcnl4GpnQA","duration":529},{"description":"This tutorial provides further practice exercises related to permutations and combinations, helping students solidify their understanding.","title":"week 5 Tutorial 3","embed":"https://www.youtube.com/embed/qLsXs2aApbw","duration":524},{"description":"This tutorial focuses on specific aspects of permutations and combinations, providing additional guidance and examples.","title":"week 5 Tutorial 4","embed":"https://www.youtube.com/embed/SKn3mX5itEQ","duration":265},{"description":"This tutorial explores different techniques for applying permutations and combinations, providing practical applications and insights.","title":"week 5 Tutorial 5","embed":"https://www.youtube.com/embed/SKfadfhtacY","duration":153},{"description":"This tutorial provides additional practice problems related to permutations and combinations, enhancing student comprehension.","title":"week 5 Tutorial 6","embed":"https://www.youtube.com/embed/q33eLiebIdk","duration":206},{"description":"This provides solutions to the practice assignment for Week 5, helping students understand the concepts and techniques discussed.","title":"Week 5 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/FiDpZNyGsIc","duration":2863},{"description":"This is a graded assignment for Week 5, covering the concepts and techniques discussed in the previous lectures.","title":"week 5 - graded Assignment","embed":"https://www.youtube.com/embed/aTYi_nEzQuk","duration":1553},{"description":"This lecture introduces the fundamental definitions of probability, laying the groundwork for understanding probability theory.","title":"Lecture 6.1 - Probability - Basic Definitions","embed":"https://www.youtube.com/embed/A4SWpP5As1M","duration":1704},{"description":"This lecture explores the concept of events and basic operations on events, including union, intersection, and complement, providing a foundation for understanding probability calculations.","title":"Lecture 6.2 - Probability - Events and basic operations on events","embed":"https://www.youtube.com/embed/G-ex734RB1Q","duration":1423},{"description":"This lecture defines a random experiment, sample space, and events, providing the framework for understanding probability in the context of experiments and outcomes.","title":"Lecture 6.3 - Probability - Random experiment, Same Space events","embed":"https://www.youtube.com/embed/bGp0DwJn2cA","duration":1285},{"description":"This lecture explores the properties of probability, including the axioms of probability, and provides examples to illustrate these properties.","title":"Lecture 6.4 - Probability - Properties of probability","embed":"https://www.youtube.com/embed/pvOPnPaSRuM","duration":3199},{"description":"This lecture introduces the concept of equally likely outcomes, providing a method for calculating probabilities when outcomes are equally probable.","title":"Lecture 6.5 - Probability - Equally likely outcomes","embed":"https://www.youtube.com/embed/4NtaTyY8Y7Y","duration":1319},{"description":"This lecture continues the discussion on equally likely outcomes, providing more examples and applications of this concept.","title":"Lecture 6.6 - Probability - Equally likely outcomes","embed":"https://www.youtube.com/embed/FqHXTluwFMg","duration":1248},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on probability.","title":"week 6 - Tutorial 1","embed":"https://www.youtube.com/embed/obAzL_J3qDI","duration":175},{"description":"This tutorial continues with practice problems related to probability, reinforcing the concepts discussed.","title":"week 6 - Tutorial 2","embed":"https://www.youtube.com/embed/QyFvfAo0aic","duration":130},{"description":"This tutorial provides further practice exercises related to probability, helping students solidify their understanding.","title":"week 6 - Tutorial 3","embed":"https://www.youtube.com/embed/gqrgpS0vdDE","duration":105},{"description":"This tutorial focuses on specific aspects of probability, providing additional guidance and examples.","title":"week 6 - Tutorial 4","embed":"https://www.youtube.com/embed/90Spk_ZgECM","duration":89},{"description":"This tutorial explores different techniques for calculating probabilities, providing practical applications and insights.","title":"week 6  - Tutorial 5","embed":"https://www.youtube.com/embed/9qeYN7pgpi0","duration":301},{"description":"This tutorial provides additional practice problems related to probability, enhancing student comprehension.","title":"week 6 - Tutorial 6","embed":"https://www.youtube.com/embed/gITH5sTR0E8","duration":99},{"description":"This tutorial covers a range of topics related to probability, providing a comprehensive overview.","title":"week 6 - Tutorial 7","embed":"https://www.youtube.com/embed/JFBjNqOUXTo","duration":239},{"description":"This provides solutions to the practice assignment for Week 6, helping students understand the concepts and techniques discussed.","title":"week 6 -  practice Solutions","embed":"https://www.youtube.com/embed/q0fW5IdW_UI","duration":2858},{"description":"This provides solutions to the graded assignment for Week 6, helping students understand the concepts and techniques discussed.","title":"Week 6 - Graded Assignment Solutions","embed":"https://www.youtube.com/embed/h0l02JQJQzA","duration":2644},{"description":"This lecture introduces the concept of conditional probability, explaining how the probability of an event changes given information about another event.","title":"Lecture 7.1 - Conditional Probability - contingency tables","embed":"https://www.youtube.com/embed/GK903pzPMbc","duration":1258},{"description":"This lecture explores the formula for calculating conditional probability, providing a mathematical framework for understanding the concept.","title":"Lecture 7.2 - Conditional Probability - Conditional probability formula","embed":"https://www.youtube.com/embed/cuA7R64v7MI","duration":905},{"description":"This lecture introduces the multiplication rule for conditional probability, providing a tool for calculating the probability of multiple events occurring in sequence.","title":"Lecture 7.3 - Conditional Probability - Multiplication rule","embed":"https://www.youtube.com/embed/0T-tLoKevQE","duration":1497},{"description":"This lecture defines independent events, exploring the concept of events that do not influence each other's probability.","title":"Lecture 7.4 -  Conditional Probability - Independent events","embed":"https://www.youtube.com/embed/PO7Jam90Wmc","duration":771},{"description":"This lecture provides examples of independent events, illustrating how to identify and analyze events that do not affect each other's probability.","title":"lecture 7.5 -  Conditional Probability - Independent events: examples","embed":"https://www.youtube.com/embed/dom7Zzn58pU","duration":999},{"description":"This lecture explores the properties of independent events, providing a deeper understanding of their characteristics and how they differ from dependent events.","title":"Lecture 7.6 -  Conditional Probability - Independent events: properties","embed":"https://www.youtube.com/embed/f0V1eq6Sycw","duration":1020},{"description":"This lecture introduces Bayes' rule, a fundamental formula for calculating conditional probabilities, providing a powerful tool for updating beliefs in light of new evidence.","title":"Lecture 7.7 -  Conditional Probability - Bayes' rule","embed":"https://www.youtube.com/embed/JoqqvK3MDRw","duration":1771},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on conditional probability.","title":"week 7 Tutorial 1","embed":"https://www.youtube.com/embed/jyAVltNg3kk","duration":113},{"description":"This tutorial continues with practice problems related to conditional probability, reinforcing the concepts discussed.","title":"week 7 Tutorial 2","embed":"https://www.youtube.com/embed/VmqYMFz4-BI","duration":147},{"description":"This tutorial provides further practice exercises related to conditional probability, helping students solidify their understanding.","title":"week 7 Tutorial 3","embed":"https://www.youtube.com/embed/v0ziVxBIfmo","duration":316},{"description":"This tutorial focuses on specific aspects of conditional probability, providing additional guidance and examples.","title":"week 7 Tutorial 4","embed":"https://www.youtube.com/embed/KsUPsW7lCos","duration":525},{"description":"This tutorial explores different techniques for applying conditional probability, providing practical applications and insights.","title":"week 7 Tutorial 5","embed":"https://www.youtube.com/embed/z5pOT7rGr5E","duration":365},{"description":"This tutorial provides additional practice problems related to conditional probability, enhancing student comprehension.","title":"week 7 Tutorial 6","embed":"https://www.youtube.com/embed/tqOcaS7Wd2c","duration":213},{"description":"This provides solutions to the practice assignment for Week 7, helping students understand the concepts and techniques discussed.","title":"week 7 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/dXPad95X-OA","duration":2519},{"description":"This provides solutions to the graded assignment for Week 7, helping students understand the concepts and techniques discussed.","title":"Week 7 - Graded Assignment Solutions","embed":"https://www.youtube.com/embed/vkqQ9YIj7_I","duration":2702},{"description":"This lecture introduces the concept of random variables, explaining their role in probability and statistics.","title":"Lecture 8.1 - Random variables  - Introduction","embed":"https://www.youtube.com/embed/a-eiVwv_zfo","duration":2738},{"description":"This lecture provides applications of random variables in real-world scenarios, showcasing their usefulness in modeling and analyzing data.","title":"Lecture 8.2 - Random variables - Application","embed":"https://www.youtube.com/embed/zRTHJBoag8E","duration":1037},{"description":"This lecture distinguishes between discrete and continuous random variables, providing a framework for understanding different types of variables encountered in probability and statistics.","title":"Lecture 8.3 - Random variables - Discrete and continuous random variable","embed":"https://www.youtube.com/embed/6EPAFA3orpA","duration":1019},{"description":"This lecture explores the properties of probability mass functions (PMFs) for discrete random variables, providing insights into their distribution and behavior.","title":"Lecture 8.4 - Discrete random variables - Probability mass function properties","embed":"https://www.youtube.com/embed/MGCD1KTWW3w","duration":1778},{"description":"This lecture provides a visual representation of probability mass functions for discrete random variables, enabling a clearer understanding of their distribution.","title":"Lecture 8.5 - Discrete random variables - Graph of probability mass function","embed":"https://www.youtube.com/embed/_4YQEV02Xek","duration":1386},{"description":"This lecture introduces the cumulative distribution function (CDF) for discrete random variables, providing a way to calculate the probability of a random variable being less than or equal to a specific value.","title":"Lecture 8.6 - Discrete random variables - Cumulative distribution function","embed":"https://www.youtube.com/embed/59sIZrAH5OQ","duration":1162},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on discrete random variables.","title":"Week 8  - Tutorial 1","embed":"https://www.youtube.com/embed/7uIhZ4Y3XN8","duration":431},{"description":"This tutorial continues with practice problems related to discrete random variables, reinforcing the concepts discussed.","title":"Week 8  - Tutorial 2","embed":"https://www.youtube.com/embed/oso9hfRNbSg","duration":355},{"description":"This tutorial provides further practice exercises related to discrete random variables, helping students solidify their understanding.","title":"Week 8  - Tutorial 3","embed":"https://www.youtube.com/embed/41u7kmcB_Wc","duration":228},{"description":"This tutorial focuses on specific aspects of discrete random variables, providing additional guidance and examples.","title":"Week 8 - Tutorial 4","embed":"https://www.youtube.com/embed/lMrwsCGgkyk","duration":320},{"description":"This tutorial explores different techniques for analyzing discrete random variables, providing practical applications and insights.","title":"Week 8 - Tutorial 5","embed":"https://www.youtube.com/embed/OC6iHzzQrv8","duration":533},{"description":"This tutorial provides additional practice problems related to discrete random variables, enhancing student comprehension.","title":"Week 8 - Tutorial 6","embed":"https://www.youtube.com/embed/htxJUbwCr7A","duration":409},{"description":"This tutorial explores the concept of infinite series as they relate to probability and statistics, providing a deeper understanding of theoretical concepts.","title":"Infinite Series Tutorial","embed":"https://www.youtube.com/embed/lHjLpm-HjSE","duration":431},{"description":"This lecture provides real-world applications of discrete random variables, showcasing their usefulness in solving practical problems.","title":"Lecture 9.1 - Discrete random variable - Application","embed":"https://www.youtube.com/embed/sI5-vTADoEI","duration":902},{"description":"This lecture introduces the concept of expectation of a random variable, defining its mathematical formula and providing insights into its interpretation.","title":"Lecture 9.2 - Expectation of a random variable","embed":"https://www.youtube.com/embed/NEgNVzox418","duration":1374},{"description":"This lecture explores the properties of expectation, providing a deeper understanding of its mathematical behavior and how it relates to different random variables.","title":"Lecture 9.3 - Expectation of a random variable - Properties of expectation","embed":"https://www.youtube.com/embed/Qfw2WeIkBkM","duration":1588},{"description":"This lecture introduces the concept of variance of a random variable, explaining its role in measuring the spread or variability of a random variable.","title":"Lecture 9.4 - Variance of a random variable - Properties of variance","embed":"https://www.youtube.com/embed/KOBa-Y9pKD8","duration":1308},{"description":"This lecture continues the discussion on the properties of variance, providing a comprehensive understanding of its mathematical behavior.","title":"Lecture 9.5 - Variance of a random variable - Properties of variance","embed":"https://www.youtube.com/embed/nLa3tHsGDiQ","duration":1061},{"description":"This lecture introduces the concept of standard deviation, providing a measure of the spread or variability of a random variable, similar to variance.","title":"Lecture 9.6 - Standard deviation of a random variable","embed":"https://www.youtube.com/embed/RGQX-9W3a-M","duration":935},{"description":"This provides solutions to the practice assignment for Week 9, helping students understand the concepts and techniques discussed.","title":"week 9 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/wB2tqlMZ2P0","duration":2299},{"description":"This lecture introduces the binomial distribution, a discrete probability distribution used to model the number of successes in a sequence of independent Bernoulli trials.","title":"Lecture 10.1 - Binomial distribution - Bernoulli distribution","embed":"https://www.youtube.com/embed/HRQHVuQkKGE","duration":820},{"description":"This lecture explores the concept of independent and identically distributed (IID) Bernoulli trials, providing the foundation for understanding the binomial distribution.","title":"Lecture 10.2 - Binomial distribution - IID Bernoulli trials","embed":"https://www.youtube.com/embed/NbcbU0TNSXA","duration":485},{"description":"This lecture defines the distribution of a binomial random variable, explaining its probability mass function and key properties.","title":"Lecture 10.3 - Binomial distribution - Distribution of Binomial random variable","embed":"https://www.youtube.com/embed/BjepdIsKBNI","duration":926},{"description":"This lecture explores how to model real-world situations using the binomial distribution, providing examples and applications of this important distribution.","title":"Lecture 10.4 - Binomial distribution - Modeling situations as Binomial distribution","embed":"https://www.youtube.com/embed/GZnEJACn1qE","duration":2274},{"description":"This lecture derives the formulas for the expectation and variance of a binomial random variable, providing insights into its central tendency and spread.","title":"Lecture 10.5 - Binomial distribution - Expectation and variance of Binomial random variable","embed":"https://www.youtube.com/embed/C5NmXX3nL3I","duration":1071},{"description":"This tutorial provides practice problems related to the concepts covered in the previous lectures, focusing on the binomial distribution.","title":"week 10  - Tutorial 1","embed":"https://www.youtube.com/embed/gYJzbSviGrM","duration":149},{"description":"This tutorial continues with practice problems related to the binomial distribution, reinforcing the concepts discussed.","title":"week 10 - Tutorial 2","embed":"https://www.youtube.com/embed/A3SqkmSF7Sk","duration":228},{"description":"This tutorial provides further practice exercises related to the binomial distribution, helping students solidify their understanding.","title":"week 10 - Tutorial 3","embed":"https://www.youtube.com/embed/jD_Jasc-E04","duration":119},{"description":"This tutorial focuses on specific aspects of the binomial distribution, providing additional guidance and examples.","title":"week 10 - Tutorial 4","embed":"https://www.youtube.com/embed/Dpmp-q3ObqU","duration":129},{"description":"This tutorial explores different techniques for applying the binomial distribution, providing practical applications and insights.","title":"week 10 - Tutorial 5","embed":"https://www.youtube.com/embed/aEvKgWhAJaU","duration":159},{"description":"This provides solutions to the practice assignment for Week 6, helping students understand the concepts and techniques discussed.","title":"week 6 -  practice Solutions","embed":"https://www.youtube.com/embed/q0fW5IdW_UI","duration":2858},{"description":"This provides solutions to the practice assignment for Week 2, helping students understand the concepts and techniques discussed.","title":"Week 2 Practice Assignment Solutions","embed":"https://www.youtube.com/embed/VxLiDPNGA_Y","duration":2773},{"description":"This provides solutions to the practice assignment for Week 4, helping students understand the concepts and techniques discussed.","title":"Week4 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/253X0ThDtko","duration":5921},{"description":"This provides solutions to the practice assignment for Week 5, helping students understand the concepts and techniques discussed.","title":"Week 5 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/FiDpZNyGsIc","duration":2863},{"description":"This provides solutions to the practice assignment for Week 7, helping students understand the concepts and techniques discussed.","title":"week 7 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/dXPad95X-OA","duration":2519},{"description":"This provides solutions to the practice assignment for Week 8, helping students understand the concepts and techniques discussed.","title":"Week 8 - Practice Assignment Solution","embed":"https://www.youtube.com/embed/Qt-1FH2Bulk","duration":2707},{"description":"This provides solutions to the practice assignment for Week 9, helping students understand the concepts and techniques discussed.","title":"week 9 - Practice Assignment Solutions","embed":"https://www.youtube.com/embed/wB2tqlMZ2P0","duration":2299},{"description":"This lecture explores the expectation and variance of the hypergeometric distribution, providing a deeper understanding of this important distribution.","title":"week 9 - Expectation of Hypergeometric Random Variable","embed":"https://www.youtube.com/embed/bZqywkM8fG4","duration":649},{"description":"This tutorial focuses on identifying and handling outliers in datasets, providing techniques for analyzing and mitigating the impact of outliers.","title":"Outliers tutorial","embed":"https://www.youtube.com/embed/jh7Mkw3XD5I","duration":549},{"description":"This provides solutions to the graded assignment for Week 3, helping students understand the concepts and techniques discussed.","title":"Week 3 - Graded Assignment Solution","embed":"https://www.youtube.com/embed/SayWVPjZsy4","duration":1795},{"description":"This is a graded assignment for Week 5, covering the concepts and techniques discussed in the previous lectures.","title":"week 5 - graded Assignment","embed":"https://www.youtube.com/embed/aTYi_nEzQuk","duration":1553},{"description":"This provides solutions to the graded assignment for Week 6, helping students understand the concepts and techniques discussed.","title":"Week 6 - Graded Assignment Solutions","embed":"https://www.youtube.com/embed/h0l02JQJQzA","duration":2644},{"description":"This provides solutions to the graded assignment for Week 7, helping students understand the concepts and techniques discussed.","title":"Week 7 - Graded Assignment Solutions","embed":"https://www.youtube.com/embed/vkqQ9YIj7_I","duration":2702},{"description":"This lecture introduces the uniform distribution, a continuous probability distribution where all values have equal probability within a specified range.","title":"Continuous random variable - Uniform distribution","embed":"https://www.youtube.com/embed/kU_SOfgoIJw","duration":1229},{"description":"This lecture explores real-world applications of the uniform distribution, demonstrating its usefulness in modeling and analyzing various phenomena.","title":"Continuous random variable - Uniform distribution: applications","embed":"https://www.youtube.com/embed/tjfwTCJd8qI","duration":1092},{"description":"This lecture introduces non-uniform and triangular distributions, providing a broader understanding of continuous distributions beyond the uniform case.","title":"Continuous random variable - Non uniform and triangular distribution","embed":"https://www.youtube.com/embed/PB1OZmo2_p4","duration":990},{"description":"This lecture explores the exponential distribution, a continuous probability distribution used to model the time until an event occurs.","title":"Continuous random variable - Exponential distribution","embed":"https://www.youtube.com/embed/TTVToWdBpYY","duration":891},{"description":"This lecture provides an introduction to continuous random variables, explaining their key characteristics and how they differ from discrete random variables.","title":"Continuous random variable - Introduction","embed":"https://www.youtube.com/embed/N35qLEQmJ8E","duration":1647},{"description":"This lecture introduces the normal distribution, a fundamental continuous probability distribution widely used in statistics and probability theory.","title":"Normal Distribution","embed":"https://www.youtube.com/embed/hcpkttOzJcY","duration":2398},{"description":"This lecture explores the standard normal distribution, a special case of the normal distribution with mean 0 and standard deviation 1.","title":"Standard Normal Distribution","embed":"https://www.youtube.com/embed/McVpplUs9po","duration":1760},{"description":"This lecture explains how to standardize a normal random variable, transforming it to a standard normal distribution, allowing for easier calculations and comparisons.","title":"Standardizing a normal random variable","embed":"https://www.youtube.com/embed/bTl41LFAV28","duration":2532},{"description":"This lecture explores the additive property of normal distributions and how to calculate percentiles for normally distributed variables.","title":"Additive Property and percentiles","embed":"https://www.youtube.com/embed/Z-puz21XKAA","duration":2046},{"description":"This lecture introduces the hypergeometric distribution, a discrete probability distribution used to model the number of successes in a sample drawn without replacement.","title":"Hypergeometric Distribution","embed":"https://www.youtube.com/embed/UGTo0FnpWJ4","duration":1863},{"description":"This lecture explores the expectation and variance of the hypergeometric distribution, providing a deeper understanding of this important distribution.","title":"Expectation and variance of  Hypergeometric Distribution","embed":"https://www.youtube.com/embed/rlVeqdA2uuU","duration":2004},{"description":"This lecture introduces the Poisson distribution, a discrete probability distribution used to model the number of events occurring in a fixed interval of time or space.","title":"Poisson Distribution","embed":"https://www.youtube.com/embed/7h3oadAkMfM","duration":1487},{"description":"This lecture explores the expectation and variance of the Poisson distribution, providing a deeper understanding of this important distribution.","title":"Expectation and variance of Poisson Distribution","embed":"https://www.youtube.com/embed/KDJApSbh60A","duration":993}],"name":"Statistics for Data Science","overview":"This course provides a comprehensive introduction to statistical concepts and methods essential for data science. Students will gain a deep understanding of descriptive statistics, probability, and distributions, equipping them with the foundational knowledge needed to analyze and interpret data effectively.","category":"mathematics","level":"beginner"},"author":"IIT Madras - B.S. Degree Programme","channel":"https://www.youtube.com/channel/UCvKzzGO37oT83K0FwnUucxw","duration":184956}